{
  "backend/main.mo": "Main backend actor implementing MLM system with user registration, profile management, withdrawal requests, loan/member referrals, access control integration, and 10-level structure with thresholds [10, 20, 40, 80, 160, 320, 640, 1280, 2560, 5120].",
  "feature_evidence.json": "Feature evidence report documenting the level structure update requirement for 10 levels with specified team sizes and rewards in frontend/src/constants/levelStructure.ts.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and constants with purple theme styling throughout the application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using oklch color space, defining purple-based color scheme for primary, sidebar, and UI elements.",
  "frontend/index.html": "HTML entry point for the React application with title 'WorldConnect Income' and root div mounting point.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, QueryClient provider, authentication guards, profile setup modal with refetch on completion, and theme provider.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to complete profile setup by entering 10-digit phone number with purple-themed styling and validation.",
  "frontend/src/components/common/AmountDisplay.tsx": "Reusable component for displaying INR currency amounts with configurable size, optional sign, and color coding (purple for positive, destructive for negative).",
  "frontend/src/components/common/StatusBadge.tsx": "Badge component displaying withdrawal request status (pending/approved/rejected) with color coding and tooltip showing rejection reason when applicable.",
  "frontend/src/components/deposit/DepositInstructions.tsx": "Card component displaying numbered step-by-step instructions for making UPI deposits with purple-themed styling.",
  "frontend/src/components/deposit/UPIPaymentQRCode.tsx": "Card component displaying UPI payment QR code image and payment details (name, UPI ID) with purple-themed border and background.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin dashboard layout component with sidebar navigation for dashboard, users, requests, and settings pages, plus logout functionality.",
  "frontend/src/components/layout/MainLayout.tsx": "Main user layout with responsive header navigation for dashboard, deposit, withdrawal, levels, referrals, and transactions, including mobile menu and footer with social links.",
  "frontend/src/components/levels/LevelProgressCard.tsx": "Displays user's current level, progress toward next level with team size tracking, and reward information using progress bars and level structure data.",
  "frontend/src/components/levels/LevelStructureTable.tsx": "Renders a table showing all 10 levels with team size requirements and rewards, highlighting the user's current level and special levels 9-10.",
  "frontend/src/components/referrals/ReferralLinkGenerator.tsx": "Generates and displays a user's unique referral link with copy-to-clipboard functionality using their Internet Identity principal.",
  "frontend/src/constants/levelStructure.ts": "Defines the 10-level MLM structure with team size requirements (10 to 5120) and rewards (100 to 25000), plus helper functions to retrieve level configurations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, handling both authenticated and anonymous actors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity state management using AuthClient, including status tracking and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, registration, deposits, withdrawals, referrals, loans, and admin operations. Manages query caching and invalidation for backend actor interactions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes using OKLCH color space. Defines CSS variables for colors, spacing, and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers. Renders the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying system statistics (users, deposits, withdrawals, pending requests) with access control. Shows placeholder stats and redirects non-admin users.",
  "frontend/src/pages/AdminRequestsPage.tsx": "Admin page for managing pending withdrawal requests with approve/reject functionality. Displays requests in a table with user details, amounts, and bank information.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin settings page with access control that currently shows a placeholder for future system configuration features. Includes admin permission checks.",
  "frontend/src/pages/AdminUsersPage.tsx": "Admin user management page with access control that displays a placeholder for future user management features. Validates admin permissions before rendering.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard displaying account overview with balance, level, status, and phone number cards. Shows level progress and quick action buttons for deposits and withdrawals.",
  "frontend/src/pages/DepositPage.tsx": "Deposit page allowing users to submit deposit requests with amount and transaction ID after making UPI payments. Displays current balance, QR code, instructions, and a form to record deposits.",
  "frontend/src/pages/LevelsPage.tsx": "Displays the MLM level income system with user's current level progress and a table showing the complete level structure and reward tiers.",
  "frontend/src/pages/LoanReferralsPage.tsx": "Placeholder page for tracking loan referrals and commissions, currently showing count with detailed tracking marked as coming in future update.",
  "frontend/src/pages/LoginPage.tsx": "Login page with phone number and OTP verification flow, supporting both regular user and admin login (phone 9422018674) using Internet Identity authentication.",
  "frontend/src/pages/MemberReferralsPage.tsx": "Member referrals page displaying user's referral link generator, total referral count, and list of recent members referred by the current user.",
  "frontend/src/pages/RegistrationPage.tsx": "User registration page collecting name, phone number, and optional referrer code with ₹100 registration fee, integrating Internet Identity for authentication.",
  "frontend/src/pages/TransactionHistoryPage.tsx": "Displays a sortable table of all user withdrawal requests with date, amount, masked bank details, IFSC code, and status badges.",
  "frontend/src/pages/WithdrawalPage.tsx": "React component for withdrawal requests with form validation for amount, bank account (9-18 digits), and IFSC code (11 characters), displaying available balance and handling submission via mutation hook.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom purple/primary color scheme (HSL 270, 70%, 50%), extended theme including fonts (Inter, Poppins), custom shadows, animations, and responsive container settings.",
  "project_state.json": "Project metadata defining WorldConnect Income as an MLM platform with 10-level income structure, phone authentication (9422018674 admin), ₹100 registration fee, and features for deposits, withdrawals, referral tracking, and admin panel."
}