{
  "backend/main.mo": "Main actor for the WorldConnect Income app, defining user profiles, loan/member referrals, withdrawal requests, OTP-based phone login, and level reward logic using stable Maps and mixins for storage and authorization.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding two new fields — `phoneToPrincipal` and `otpRecords` maps — while preserving all existing state from the old actor shape.",
  "feature_evidence.json": "Feature evidence report confirming high-confidence implementation of the member mobile OTP login feature, referencing the affected files `useQueries.ts` and `LoginPage.tsx` and test ID REQ-46.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-line summaries of all frontend source files, serving as a build/documentation reference for the project's React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, charts, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'WorldConnect Income', mounting the app at `#root` and loading `src/main.tsx` as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes, QueryClient, ThemeProvider, and a ProfileSetupModal triggered when an authenticated user has no saved profile.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their full name and phone number to complete account setup, submitting via an async `onComplete` callback.",
  "frontend/src/components/banking/LoanBankingServicesSection.tsx": "Renders a grid of banking/loan service cards (KYC Loan, Salary Loan, Business Loan, Zero Balance Account, Credit Card) with icons, descriptions, badges, and an 'Apply Now' button for each.",
  "frontend/src/components/common/AmountDisplay.tsx": "A reusable component that formats and displays an INR currency amount with configurable size, optional sign prefix, and color coding for negative vs. positive values.",
  "frontend/src/components/common/StatusBadge.tsx": "Displays a colored badge for a withdrawal status (pending, approved, or rejected), with a tooltip showing the rejection reason for rejected statuses.",
  "frontend/src/components/deposit/DepositInstructions.tsx": "Renders a numbered step-by-step instruction card explaining how to make a UPI deposit and submit the transaction ID.",
  "frontend/src/components/deposit/UPIPaymentQRCode.tsx": "Displays a UPI payment QR code image along with the payee name and UPI ID for making deposits.",
  "frontend/src/components/layout/AdminLayout.tsx": "Provides the admin panel shell with a fixed red sidebar containing navigation links (Dashboard, Requests, Users, Settings), a logout button, and a main content area.",
  "frontend/src/components/layout/MainLayout.tsx": "Provides the main user-facing layout with a sticky header, a hamburger-triggered mobile menu, and a fixed bottom navigation bar for the core app routes.",
  "frontend/src/components/levels/LevelProgressCard.tsx": "Shows the user's current MLM level, team size, a progress bar toward the next level, and reward amounts for the current and next levels.",
  "frontend/src/components/levels/LevelStructureTable.tsx": "Renders a table of all MLM levels with their required team size, reward amount, and a status badge (Active, Achieved, or Locked) based on the user's current level.",
  "frontend/src/components/referrals/ReferralLinkGenerator.tsx": "React component that displays a user's referral link (built from their principal ID) with a copy-to-clipboard button and visual feedback.",
  "frontend/src/constants/levelStructure.ts": "Defines a 10-level MLM-style structure with team size thresholds and rewards, plus helper functions to retrieve config for a given level or the next level.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions including user profile CRUD, registration, deposits, withdrawals, and admin operations.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Poppins fonts, configures Tailwind CSS, and defines light/dark mode CSS custom properties for the design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that displays summary statistics (pending, approved, rejected withdrawal counts and total amount) and a referral link generator for the admin.",
  "frontend/src/pages/AdminRequestsPage.tsx": "Admin page for viewing and managing all withdrawal requests, with approve and reject (with reason dialog) actions using React Query mutations.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Placeholder admin page for system settings configuration, currently showing a 'coming soon' message.",
  "frontend/src/pages/AdminUsersPage.tsx": "Placeholder admin page for user management, currently showing a 'coming soon' message.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard displaying profile info, balance, team size, total earnings, level income, and navigation to key actions like deposit and withdrawal.",
  "frontend/src/pages/DepositPage.tsx": "Deposit page allowing users to submit a deposit by entering an amount and UPI transaction ID, with a QR code and instructions for payment.",
  "frontend/src/pages/LevelsPage.tsx": "Page showing the user's level income summary, current level, team size, level progress card, and a level structure table.",
  "frontend/src/pages/LoanReferralsPage.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/LoginPage.tsx": "Login page with tabs for member (phone + OTP flow) and admin (phone-based) login, using Internet Identity and React Query mutations.",
  "frontend/src/pages/MemberReferralsPage.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/RegistrationPage.tsx": "React page for new user registration that handles Internet Identity login, collects name/phone/referrer inputs, charges a ₹100 fee, and navigates to the dashboard on success.",
  "frontend/src/pages/TransactionHistoryPage.tsx": "React page that fetches and displays the caller's withdrawal requests in a styled table with amount, bank details, date, and status columns.",
  "frontend/src/pages/WithdrawalPage.tsx": "React page allowing users to submit a withdrawal request, enforcing a 1%-of-balance limit and requiring bank details before calling the withdrawal mutation.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them in sessionStorage, and remove sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a red color palette, custom box shadows, Inter/Poppins fonts, CSS-variable-based semantic colors, and accordion keyframe animations.",
  "project_state.json": "Project state manifest (version 35) describing the WorldConnect Income MLM app's architecture, implemented features, and requirements including multi-level income, registration, deposits, withdrawals, and admin panel."
}