{
  "kind": "build_request",
  "title": "Mobile Number Login for Regular Members",
  "projectName": "WorldConnect Income",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-46",
      "text": "Extend the LoginPage (frontend/src/pages/LoginPage.tsx) to support mobile number login with OTP verification for regular members (not just admin). Add a 'Member Login' tab or section alongside the existing admin phone login, allowing any user to enter their registered mobile number, receive/enter a simulated OTP, and authenticate. On successful OTP verification, look up the user by phone number in the backend and establish their session. If no user is found with that phone number, show an appropriate error message directing them to register first.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Mobile number login"
        ]
      },
      "acceptanceCriteria": [
        "LoginPage displays a mobile number login option for regular members (distinct from the admin login flow).",
        "User can enter their mobile number and request an OTP.",
        "OTP input field appears after mobile number submission.",
        "On correct OTP entry, the user is authenticated and redirected to the dashboard.",
        "If the phone number is not registered, an error message is shown.",
        "Backend exposes a query to look up a user by phone number.",
        "Backend stores/validates OTP for mobile login authentication.",
        "Admin login (phone 9422018674) continues to work as before."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Update the backend actor in backend/main.mo to support member phone number authentication: add a function to initiate OTP generation for a given phone number (returning the OTP or storing it server-side), and a function to verify the OTP and return the associated user's principal. Add a query to look up a registered user profile by phone number so the frontend can authenticate members via mobile number.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Mobile number login"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a function `requestMemberOTP(phone: Text): async Text` (or equivalent) that generates and stores a time-limited OTP for the given phone number.",
        "Backend exposes a function `verifyMemberOTP(phone: Text, otp: Text): async Bool` that validates the submitted OTP.",
        "Backend exposes a query `getUserByPhone(phone: Text): async ?UserProfile` that returns the user profile matching the given phone number.",
        "OTP verification fails gracefully if the phone number is not registered.",
        "Existing admin phone login logic is not affected."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Admin login flow for phone number 9422018674 must remain unchanged.",
    "All Motoko logic must remain in backend/main.mo as a single actor."
  ],
  "nonGoals": [
    "SMS gateway integration or real SMS delivery (OTP simulation is acceptable).",
    "Replacing Internet Identity login — both flows should coexist.",
    "Changing any existing page styling or color scheme."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}