{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile Number Login for Regular Members",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Extend LoginPage to support mobile number login with OTP verification for regular members, allowing any user to authenticate via their registered phone number",
      "acceptanceCriteria": [
        "LoginPage displays a mobile number login option for regular members (distinct from the admin login flow).",
        "User can enter their mobile number and request an OTP.",
        "OTP input field appears after mobile number submission.",
        "On correct OTP entry, the user is authenticated and redirected to the dashboard.",
        "If the phone number is not registered, an error message is shown.",
        "Admin login (phone 9422018674) continues to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Add a 'Member Login' tab or section alongside the existing admin phone login flow. Implement a two-step member authentication flow: (1) User enters mobile number and requests OTP via the backend's requestMemberOTP/generateOTPForPhone method; (2) User enters the received OTP and submits for verification via verifyPhoneAndLogin. On successful verification, retrieve the user's principal from the backend response and establish their session. If the phone number is not registered or OTP is invalid, display appropriate error messages. Ensure the existing admin login flow for phone number 9422018674 remains unchanged and functional."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add two new mutation hooks for member phone authentication: useRequestMemberOTP (calls actor.generateOTPForPhone) and useVerifyMemberOTP (calls actor.verifyPhoneAndLogin). The verify mutation should return the authenticated principal on success or null if verification fails. Include proper error handling and loading states for both mutations. These hooks will be consumed by the updated LoginPage component to implement the member OTP login flow."
        }
      ]
    }
  ]
}